{
  "stats": {
    "name": "Kar Wei",
    "age": 18,
    "occupation": "Student studying IT Security at Singapore Polytechnic",
    "status": "Currently working to get my OSCP!",
    "skills": [
      "ReactJS w/ Typescript",
      "Redux",
      "Java",
      "Game Dev",
      "NodeJS/Express",
      "MySQL",
      "Python",
      "AWS Cloud",
      "Malware Analysis",
      "Pentesting",
      "FastAPI"
    ],
    "toolsUsed": [
      "Unity in C#",
      "VSCode",
      "Android Studio",
      "Figma",
      "VMWare Workstation"
    ]
  },
  "education": {
    "schoolList": [
      {
        "schoolName": "Singapore Polytechnic",
        "studyPeriod": "2019-Current",
        "studyScope": "Diploma in Infocomm Security Management",
        "academicComponent": {
          "gpa": "3.96",
          "sectionList": [
            {
              "sectionTitle": "Year 1",
              "bulletPoints": [
                "director's honour roll AY2019/2020",
                "Certificate of Academic Achievement 2020"
              ]
            },
            {
              "sectionTitle": "Year 2",
              "bulletPoints": [
                "director's honour roll AY2020/2021"
              ]
            }
          ]
        },
        "ccaList": [
          "school of computing ambassadors (head of r&d team) 2020/2021",
          "DISM gryphons (member)",
          "seed student interest group (member)",
          "japanese cultural club Community Involvement Programme (CIP) head 2021/2022"
        ],
        "awardsList": [
          "dso diploma scholarship",
          "singapore poly outstanding talent programme (SPOT)",
          "SP Edge Scholars programme"
        ]
      },
      {
        "schoolName": "Chung Cheng High (Yishun)",
        "studyPeriod": "2015-2019",
        "studyScope": "Express Stream",
        "academicComponent": {
          "gpa": "",
          "sectionList": [
            {
              "sectionTitle": "GCE O Levels 2018",
              "bulletPoints": [
                "raw l1r5 - 6",
                "top scorer (cchy) 2018",
                "8 distinctions"
              ]
            }
          ]
        },
        "ccaList": [
          "symphonic band (basses section leader) - i play the euphonium!"
        ],
        "awardsList": [
          "student of the year 2018",
          "EDUSAVE certificate of academic achievement 2015, 2016",
          "CDC-CCC education merit award 2016",
          "EDUSAVE scholarship 2017, 2018",
          "Singapore Youth Festival, Silver Award"
        ]
      }
    ]
  },
  "experience": {
    "positionList": [
      {
        "role": "Tech Lead | Backend Developer",
        "division": "CDD",
        "organisation": "Cyber Youth Singapore",
        "positionPeriod": "Jul 2021 to Present",
        "descriptionList": [
            "Tech lead for the NEST platform, an educational mobile app product aimed at educating and guiding youths within cybersecurity under the CYS Community Development Department's Learning and Engagement Matrix (LEM)",
            "Setup and develop backend infrastructure on the cloud",
            "Currently under NYC's Youth Tech Programme (YTP) as a Technical Specialist"
        ]
      },
      {
        "role": "Malware Analyst Intern",
        "division": "MA",
        "organisation": "Govtech",
        "positionPeriod": "Apr 2021 to Present",
        "descriptionList": [
            "Full year internship under the Govtech PTP Programme, a special work-learn programme for year 3 students in SP",
            "Went through a selection process including interview and assessment quizzes to be one of 2 students in the DISM cohort to be a part of this special programme"
        ]
      },
      {
        "role": "Python Developer and AWS Cloud Engineer",
        "division": "PT",
        "organisation": "Gifting.sg",
        "positionPeriod": "Nov 2020 to Jul 2021",
        "descriptionList": [
            "Mostly worked on their backend server and infrastructure fully coded in Python",
            "Also deployed and managed CI/CD solutions and hosting on AWS Cloud"
        ]
      },
      {
        "role": "Director (Volunteer)",
        "division": "Community Development Department",
        "organisation": "Cyber Youth Singapore",
        "positionPeriod": "Sept 2020 to Present",
        "descriptionList": [
          "Spearhead community development initiative to provide a safe ground for youths to explore cybersecurity with a projected reach of 1000+ youths",
          "Liaise with community and industry partners to bring benefits to youths in tech",
          "Regular speaks in outreach events to youths to spread cybersecurity awareness and introduce the youth development efforts of CYS"
        ]
      },
      {
        "role": "Red Teaming Intern",
        "division": "Information Division",
        "organisation": "DSO National Laboratories",
        "positionPeriod": "Aug 2019 to Oct 2019",
        "descriptionList": [
          "i served a 2 month internship period in dso national laboratories in my year 1 study in singapore polytechnic.",
          "my project was on automated red teaming where an ai was built to think and act like a penetration tester. i was mainly tasked with developing the penetration tools used for the project.",
          "with the aid of my supervisor and peers in dso, i learnt about working in an actual penetration testing environment and further broadened my experience in penetration testing techniques"
        ]
      }
    ]
  },
  "achievements": {
    "awards": [
      {
        "achievementRoute": "svrp-2020",
        "issueDate": "Mar 2021",
        "title": "SVRP 2020 Gold and Valedictorian",
        "issuedBy": "Association of Information Security Professionals",
        "descripList": [
            "I was honoured to be attend the SVRP award ceremony as a gold award recipient and valedictorian for SVRP 2020.",
            "The award ceremony included a dialogue session with Senior Minister of State Dr Janil Puthucheary on the interest in cybsecurity among youths in Singapore. Link below for some of the thoughts I shared during this event.",
            "https://www.linkedin.com/posts/kar-wei-loh_cybersecurity-volunteering-community-activity-6781925412550385664-84G2"
        ]
      },
      {
        "achievementRoute": "dir-honour-roll-2019",
        "issueDate": "AY 2019/2020",
        "title": "Director's Honour Roll",
        "issuedBy": "Singapore Polytechnic",
        "descripList": [
          "This award is awarded to the top 10% of students in the DISM AY 2019/2020 cohort."
        ]
      },
      {
        "achievementRoute": "svrp-2019",
        "issueDate": "Oct 2019",
        "title": "SVRP 2019 Silver",
        "issuedBy": "Association of Information Security Professionals",
        "descripList": [
          "This award signifies my completion of 2 out of 3 pillars in the SVRP Framework.",
          "In total I had volunteered more than 30 hours in the Skills pillar and more than 60 hours in the Events pillar from Sept 2018 to Aug 2019."
        ]
      },
      {
        "achievementRoute": "hackasia-2019",
        "issueDate": "Oct 2019",
        "title": "Hack.Asia 2019 2nd Place",
        "issuedBy": "Daimler Mobility",
        "descripList": [
          "I had the honour to team up with 3 of my seniors for this 24 hour hackathon, where we built a prototype and pitched to the attending participants and a panel of judges.",
          "The challenge problem we picked was on gamifying the learning of Information Security through Augmented Reality (AR), where Daimler was looking to use it to engage and educate their employees in a professional workplace.",
          "This hackathon had attracted 800 student applicants from 23 countries in 24 hours and we were fortunate to be awarded 1st Runner-Up for our challenge.",
          "Following the event, we were approached by Jardines to present our idea at the 2019 Jardines Digital Conference in Hong Kong. However, due to ongoing riots in HK at that time, out team had to reject the offer.",
          "So many great things happened during this event, but my most prominent memory of this would be travelling to the Mandarin Oriental Hotel from AWS' HQ to continue the event for the night where the organisers ordered more than 100 McDonald's burgers for the participants as supper :D",
          "Yea that and also sneaking out in the middle of the night through the event to have a sick night walk around Marina Bay Sands with my team. Fun times."
        ]
      },
      {
        "achievementRoute": "dso-scholarship-2019",
        "issueDate": "2019",
        "title": "DSO Diploma Scholarship",
        "issuedBy": "DSO National Laboratories",
        "descripList": [
          "DSO National Laboratories (DSO) is Singapore’s largest defence research and development (R&D) organisation, with the critical mission to develop technological solutions to sharpen the cutting edge of Singapore's national security.",
          "I had the honour of receiving this scholarship before my first year in DISM together with another year 2 senior taking the same course."
        ]
      },
      {
        "achievementRoute": "cys-camp-hackathon-2019",
        "issueDate": "Dec 2019",
        "title": "CYS Camp Hackathon Champion",
        "issuedBy": "Cyber Youth Singapore",
        "descripList": [
          "I originally volunteered as a Group Leader in this event to meet new people. Who knew we would actually win the design thinking hackathon lmao.",
          "Spanning a total of 4 days, 3 of them were spent attending talks, workshops, and brainstorming for ideas for the Design Hackathon. Each group had an assigned group leader (which was me) and my group had 8 other members, ranging from students studying in poly to secondary school.",
          "Our group came up with Cygage, a centralised youth platform aiming to envelope all of CYS' vision and activities for youths of all ages to participate in and mingle. Our idea was well received during the pitch, and the winner was promptly announced the next day.",
          "Following the announcement, we were met with a short video interview by CNA and had to present our idea to the crowd of participants and additional guests present on the day of the official launch of CYS.",
          "Soon after the event, I was asked to join CYS and that's where my journey began in the then talent management team headed by Kenneth. Though Cygage did not eventually come into the fruition, I got the opportunity to work on a similar large scale project as the current Head of Talent Development Department in CYS. More coming soon :))"
        ]
      },
      {
        "achievementRoute": "cys-camp-ctf-2019",
        "issueDate": "Dec 2019",
        "title": "CYS Camp CTF 3rd Place",
        "issuedBy": "Cyber Youth Singapore",
        "descripList": [
          "This 10 hour CTF occured on the last day of the 4 day CYS camp held in December 2019. All participants were required to form teams of 2-3 members to participate in the CTF.",
          "I'm not gonna lie here, the main reason my team won even though we only had 2 members while the other winning teams had 3 was due to the presence of my amazingly talented senior, Bryon, who is now participating in WorldSkills 2020.",
          "Back then the me had script kiddie level knowledge on reverse engineering and Bryon's knowledge of RE greatly put our team at an advantage as the hardest challenges were all RE challenges.",
          "Even so, I managed to walk home with 200SGD and a great learning experience I'll never forget. Nice."
        ]
      },
      {
        "achievementRoute": "cxa-2019",
        "issueDate": "June 2019",
        "title": "CXA 2019 Finalist (Open Category)",
        "issuedBy": "Infocomm Media Development Authority",
        "descripList": [
          "I'm not kidding. This was actually my first hackathon in my entire life.",
          "I participated alongside a friend I knew from secondary school (was in JC at that time) in the open category which was open to participants of all ages and largely consisted of University and Polytechnic students.",
          "The challenge statement we picked was on smart recycling, and we built a functional locker powered with a raspberry pi and backed with firebase in 24 hours. After a initial pitch during the event, we were later notified that we had gotten into the finalist stage and another pitch to a huge panel of judges was done a few days later.",
          "Though we did not emerge victorious, it was a valuable experience and largely contributed to my love for participating in on-premise hackathons now."
        ]
      }
    ],
    "certs": [
      {
        "achievementRoute": "cmls-2019",
        "issueDate": "Oct 2019",
        "title": "Certified Machine Learning Specialist",
        "issuedBy": "Global Science and Technology Forum",
        "descripList": [
          "This certification required participants to attend a 4 day training course, with a final theory MCQ test at the end and a 2 week project to be submitted before our results would be announced and our cert presented to us.",
          "I decided to do a project on Natural Language Processing, and built a chatbot from scratch using Keras in Python. I had a scored 87.5% on my MCQ and 86% on my project work component.",
          "The reason why I took this course was due to the fact that I was interning at DSO at that time, and my project was basically split between red teaming and deep learning. I was mainly working on the red teaming portion, though eventually my supervisor allowed me to join in on the deep learning part after I had learnt more about ML concepts through this cert.",
          "This cert was also fully subsidised under the IMDA Citrep+ Scheme."
        ]
      },
      {
        "achievementRoute": "ossa-2020",
        "issueDate": "Oct 2020",
        "title": "Organisational Systems Security Analyst",
        "issuedBy": "THINKSECURE",
        "descripList": [
          "This certification spanned a 4 day training course with a MCQ practical test on the 5th day which consists of theory based questions and practical based questions requiring us to physically interact with the lab machines through their VPN network.",
          "The marking scheme was new to me, as wrong answers would lower your overall score and not answering questions are actually better in some cases. Nevertheless, I managed to score a percentage of 81.33% out of 100%. 60% was required to pass."
        ]
      },
      {
        "achievementRoute": "aws-dev-associate-2020",
        "issueDate": "Oct 2020",
        "title": "AWS Certified Developer Associate",
        "issuedBy": "Amazon Web Services",
        "descripList": [
          "Before this certification my cloud knowledge was laughable. Stephane Maarek's Udemy course helped loads in helping me gain a better understanding of many AWS services covered under this certification and ultimately helped me pass the exam",
          "However, I felt that the course alone was not enough to get a better than average score on the exam and additional practice exams should be done.",
          "All in all, I scored a 916 out of 1000 for the exam and is extremely happy with my decision to take up this certification course. Will definitely be looking at the other certification routes in the future!"
        ]
      }
    ]
  },
  "projects": [
    {
      "projectRoute": "detectivehex",
      "imageUrlList": [
        "detectivehex-1"
      ],
      "projectTitle": "DetectiveHex",
      "projectPeriod": "Ongoing",
      "tags": [
        "Game Dev",
        "Unity",
        "Infocomm Security"
      ],
      "builtWith": [
        "Unity Game Engine",
        "Unity WebGL",
        "C#",
        "Firebase"
      ],
      "projectLink": "https://detectivehex-66530.web.app/",
      "descripList": [
        "A SOCA R&D project I'm leading, built to be used in SOCA's outreach events to teach secondary school students in Singapore the basics of infocomm security.",
        "This browser-based game is built using the Unity game engine and WebGL, and hosted using Firebase.",
        "This game is currently under development, but you can view our 1st draft by clicking on the title!"
      ]
    },
    {
      "projectRoute": "sp-neo",
      "imageUrlList": [
        "sp-neo-1"
      ],
      "projectTitle": "SPNeo",
      "projectPeriod": "Sept 2019",
      "tags": [
        "NLP",
        "Graph Database"
      ],
      "builtWith": [
        "Jupyter Notebook",
        "Keras",
        "Python",
        "Neo4j Graph Database"
      ],
      "projectLink": "https://github.com/Asienwald/AI-Chatbot-with-Neo4j",
      "descripList": [
        "This project consists of a chatbot backed by a neo4j graph database. It was built on the idea of a relational graph database which is able to depict the realtime states of SP, represented with the different nodes and relations in the database.",
        "The graph can then be queried through the chatbot, hence allowing for visitors/new students of SP to find their way around better and also be able to query specific, miniscule details happening around SP. The graph can also be scaled to even represent store queue times, parking lot availability etc.",
        "This was built in under 24 hours during the duration of the hackathon hence it is not fully completed. I plan to continue on the project someday and add an interface for better user experience."
      ]
    },
    {
      "projectRoute": "sp-travel",
      "imageUrlList": [
        "sp-travel-1"
      ],
      "projectTitle": "SP Travel",
      "projectPeriod": "June - Oct 2020",
      "tags": [
        "Backend",
        "NodeJS",
        "MySQL"
      ],
      "builtWith": [
        "Express",
        "MySQL Server",
        "Bootstrap"
      ],
      "projectLink": "https://github.com/Asienwald/sp-travel",
      "descripList": [
        "This was done for my Backend Development Module together with another teammate using an Express web server and MySQL database.",
        "The site is able to serve travel listings, review them and also has an admin console for administration purposes."
      ]
    },
    {
      "projectRoute": "elcare",
      "imageUrlList": [
        "elcare-1",
        "elcare-2",
        "elcare-3",
        "elcare-4",
        "elcare-5",
        "elcare-6",
        "elcare-7",
        "elcare-8",
        "elcare-9"
      ],
      "projectTitle": "ElCare",
      "projectPeriod": "Sept 2020",
      "tags": [
        "Android App Dev",
        "IBM Cloud",
        "Flask",
        "IoT"
      ],
      "builtWith": [
        "Android Studio",
        "IBM Watson",
        "Flask Python Framework",
        "ESP8266/Arduino"
      ],
      "projectLink": "https://github.com/Asienwald/ElCare",
      "descripList": [
        "This app was built to provide fast followup responses to emergencies involving elderly through Community First Responders (CFRs) around Singapore.",
        "I mainly worked with the development and design of the app and integrating it with IBM's Watson. More information can be found on my github (click project title)!"
      ]
    },
    {
      "projectRoute": "platformer-site",
      "imageUrlList": [
        "platformer-site-1",
        "platformer-site-2",
        "platformer-site-3"
      ],
      "projectTitle": "Platformer Site",
      "projectPeriod": "Oct 2020",
      "tags": [
        "Reactjs",
        "Web Dev",
        "Redux"
      ],
      "builtWith":[
        "ReactJS with Typescript",
        "Redux State Management",
        "Framer Motion"
      ],
      "projectLink": "https://github.com/Asienwald/Platformer-Site",
      "descripList":[
        "A site built for my portfolio and at the same time learn more about react, redux and typescript.",
        "This website is actually my first site built with React! And it's also the one you're currently looking at now."
      ]
    },
    {
      "projectRoute": "polyfintech-stonks",
      "imageUrlList": [
        "stonks-1",
        "stonks-2",
        "stonks-3",
        "stonks-4"
      ],
      "projectTitle": "Stonks",
      "projectPeriod": "July 2020",
      "tags": [
        "Blockchain",
        "Decentralised Apps",
        "Fintech"
      ],
      "builtWith":[
        "Android Studio",
        "Ganache Development Blockchain",
        "Truffle Development Environment",
        "Invision Studio"
      ],
      "projectLink": "https://github.com/Asienwald/Polyfintech-Stonks-App",
      "descripList":[
        "This app was submitted for the Polyfintech 100 API Hackathon 2020. It serves as a decentralised app at educating and empowering youths on financial literacy and the benefits cryptocurrencies can bring.",
        "I mainly worked with the design and development of the application in Android Studio."
      ]
    },
    {
      "projectRoute": "sp-spam",
      "imageUrlList": [
        "sp-spam-1",
        "sp-spam-2",
        "sp-spam-3",
        "sp-spam-4",
        "sp-spam-5"
      ],
      "projectTitle": "SP SPAM App",
      "projectPeriod": "Feb 2020",
      "tags": [
        "Python",
        "App Dev"
      ],
      "builtWith":[
        "Kivy Python Framework",
        "SQLite"
      ],
      "projectLink": "https://github.com/Asienwald/SP-SPAM",
      "descripList":[
        "This was an assignment done for school but I took it upon myself to add additional features, including a user interface built with Kivy.",
        "A server is run alongside the client program to serve food orders through the interface.",
        "The original assignment only asked for a command line interface for the client and server."
      ]
    },
    {
      "projectRoute": "isears",
      "imageUrlList": [
        "isear-1"
      ],
      "projectTitle": "I.S.E.A.R",
      "projectPeriod": "Oct 2019",
      "tags": [
        "AR",
        "Infocomm Security",
        "AWS"
      ],
      "builtWith":[
        "AWS Sumerian",
        "HTML"
      ],
      "projectLink": "https://github.com/hanscau/I.S.E.A.R",
      "descripList":[
        "Teaching infocomm security through the use of Augmented Reality and gamification."
      ]
    },
    {
      "projectRoute": "restation",
      "imageUrlList": [
        "restation-1",
        "restation-2"
      ],
      "projectTitle": "REStation",
      "projectPeriod": "July 2019",
      "tags": [
        "Web Dev",
        "Arduino",
        "Firebase"
      ],
      "builtWith":[
        "Firebase",
        "Bootstrap",
        "Arduino"
      ],
      "projectLink": "https://github.com/Hackin7/ReStation",
      "descripList":[
        "ReStation acts as a middle-man for people to declutter their homes and list out unused items for others to claim and use.",
        "The solution features an account system, listing and claiming system and milestone system to incentivise the act of recycling your everyday items.",
        "This project was built in less than 24 hours and I mainly worked with the website and backend integration with the raspberry pi/arduino powered locker.",
        "This project was done in my first hackathon when I still didn't know how to use github!"
      ]
    }
  ],
  "contact": {
    "email": "asienwald@gmail.com",
    "discord": "Asienwald#7081",
    "linkedinLink": "https://www.linkedin.com/in/kar-wei-loh",
    "githubLink": "https://github.com/Asienwald"
  }
}